import { NextResponse } from "next/server";

const templates = [
  {
    title: "認識の確認",
    content:
      "現在ご希望の機能の調査にあたって、以下の認識に相違がないかご確認お願いいたします。\\n- [Question]\\n\\nご認識と齟齬がある場合はお知らせください。",
  },
  {
    title: "詳細情報質問",
    content:
      "現在ご提示のエラーについての調査にあたって、以下の情報をご提供お願いいたします。\\n1. 事象発生レコード：\\n2. 事象再現手順：\\n※ログイン後の事象発生まで各画面での操作手順を可能な限り詳細にお願いいたします。\\n\\n大変お手数ですが、より正確な回答をするために上記情報をご提示いただけますと幸いです。",
  },
  {
    title: "機能拡張提案",
    content:
      "大変恐れ入りますが、現状 [Description] 機能はご用意しておりません。\\n\\nご希望に沿うご案内ができず大変恐縮ですが、ご希望の機能を機能拡張（ER、Enhancement Request）として提出しますと、今後のバージョンアップに伴い、機能として実装される可能性がございます。\\n\\n機能拡張提出をご希望の際は遠慮なくお申し付けください。",
  },
  {
    title: "機能拡張提出完了",
    content:
      "ご要望の機能は管理番号 [EnhancementNumber] として ER を提出させていただきました。\\n\\nなお、ER の採用可否の評価と決定、および採用される場合の実現時期の決定は、弊社単独で行います。\\n恐れ入りますが、お客様からのエスカレーションは承っておりませんので、ご理解およびご了承ください。\\n\\nそれでは上記のご報告をもちまして、このチケットのステータスを SOLVED-Filed for Future Consideration といたします。\\n貴重なご意見をいただき、ありがとうございました。",
  },
  {
    title: "BUG 登録完了",
    content:
      "この度はご不便をおかけして大変申し訳ございません。\\n\\n本件は管理番号 [BUGnumber] として登録させていただきました。\\n担当者から返答いただき次第ご報告いたします。\\n\\n大変恐縮ですが、今しばらくお待いただくようお願い申し上げます。",
  },
  {
    title: "環境アップグレードリマインド",
    content:
      "貴社[Env]環境は本日日本時間 [time] 時よりアップグレードを実施させていただきます。\\n\\nお手数ですが、すべてのユーザー様に該当時間帯はログアウトいただくようご通達をお願いいたします。\\nアップグレード実施後に当サポートより環境確認を実施し、確認完了の通知をいたしますので、その後ユーザー様にログインを再開いただけますようお願い申し上げます。",
  },
  {
    title: "サービスリセット済み",
    content:
      "[ServiceName] をリセットいたしました。\\n\\nお手数ですが、一度ログアウトしていただき、再ログインしてからダッシュボードがロードされているかをご確認お願いいたします。\\n※ロードに時間がかかる場合もございます。",
  },
];

export async function POST() {
  return NextResponse.json({ templates });
}
